In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [3]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [5]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['LA','SF','NY'],columns=['size','pop','year'])
dframe1

    size  pop  year
LA     0    1     2
SF     3    4     5
NY     6    7     8

In [7]:
dframe2 = dframe1.drop('LA')
dframe2

    size  pop  year
SF     3    4     5
NY     6    7     8

In [10]:
dframe1.drop('year',axis=1)

    size  pop
LA     0    1
SF     3    4
NY     6    7

In [11]:
ser1 = 2*ser1
ser1

a    0
b    2
c    4
dtype: int32

In [17]:
ser1['b']

2

In [18]:
ser1[0:3]

a    0
b    2
c    4
dtype: int32

In [20]:
ser1[ser1>1]

b    2
c    4
dtype: int32

In [21]:
ser1[ser1>3] = 10

In [22]:
ser1

a     0
b     2
c    10
dtype: int32

In [23]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NY','SF','DC','LA','SD'],columns= ['a','b','c','d','e'])

In [24]:
dframe

     a   b   c   d   e
NY   0   1   2   3   4
SF   5   6   7   8   9
DC  10  11  12  13  14
LA  15  16  17  18  19
SD  20  21  22  23  24

In [25]:
dframe[dframe['c']>8]

     a   b   c   d   e
DC  10  11  12  13  14
LA  15  16  17  18  19
SD  20  21  22  23  24

In [26]:
dframe>10

        a      b      c      d      e
NY  False  False  False  False  False
SF  False  False  False  False  False
DC  False   True   True   True   True
LA   True   True   True   True   True
SD   True   True   True   True   True

In [28]:
dframe.loc['LA']

a    15
b    16
c    17
d    18
e    19
Name: LA, dtype: int32

In [30]:
dframe.ix[1]

a    5
b    6
c    7
d    8
e    9
Name: SF, dtype: int32

In [31]:
ser3 = dframe.ix[0]

In [32]:
ser3

a    0
b    1
c    2
d    3
e    4
Name: NY, dtype: int32